In [2]:
import pandas as pd
df = pd.read_csv(r"C:\Users\\Natan\\OneDrive\\Documents\\Victor-projects\\projetos_python\\Data_analysis\\salaries-mls\\2008\\mls-salaries-2008.csv")
df

    club last_name first_name position  base_salary  guaranteed_compensation
0     LA  Adzemian     Vardan        D      12900.0                  12900.0
1     LA     Alamo    Charles       GK      12900.0                  12900.0
2     NE  Albright      Chris        D     160000.0                 160000.0
3    HOU   Alcaraz     Johnny        M      12900.0                  12900.0
4     LA     Allen        Ely        F      12900.0                  12900.0
..   ...       ...        ...      ...          ...                      ...
406   DC     Zaher       Mike        D      12900.0                  12900.0
407  COL  Zambrano      Cesar        M      12900.0                  12900.0
408   KC  Zavagnin      Kerry        M     169400.0                 169400.0
409  CLB    Zayner        Jed        D      36300.0                  43800.0
410  CHV   Zotinca       Alex        D      70875.0                  72125.0

[411 rows x 6 columns]

In [2]:
df['full_name'] = df['first_name'] + ' ' + df['last_name'] + ' ' + df['club']
df_agrupado = df.groupby('full_name', as_index=False)['base_salary'].max()
df_agrupado = df_agrupado.sort_values(by='base_salary', ascending=False)
df_agrupado

                 full_name  base_salary
114       David Beckham LA   5500000.08
100  Cuauhtemoc Blanco CHI   2492316.00
278    Marcelo Gallardo DC   1500000.00
235    Juan Pablo Angel NY   1500000.00
269      Landon Donovan LA    900000.00
..                     ...          ...
324         Pat Carroll DC     12900.00
252        Kevin Burns CLB     12900.00
141           Ely Allen LA     12900.00
302          Mike Munoz LA     12900.00
243       Kasey Keller SEA          NaN

[411 rows x 2 columns]

In [3]:
df_agrupado = df.groupby('club')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

club
LA      260309.809032
CHI     156519.532857
DC      139863.548387
NY      106350.583333
TFC      94194.985200
KC       89006.884615
SJ       88947.694444
HOU      85237.748571
COL      79956.695862
DAL      78863.793103
RSL      77538.962857
NE       77409.092593
CHV      71701.536562
CLB      67360.671290
SEA      58500.000000
Pool     21200.000000
Name: base_salary, dtype: float64

In [7]:
df_agrupado = df.groupby('position')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

position
M     139764.191933
F     123219.502791
D      69087.578333
GK     55478.261667
Name: base_salary, dtype: float64

In [6]:
df['base_salary'].mean()

104706.09136585364

In [3]:
df_filtered = df[df['base_salary'] < 1500000]
df_filtered['base_salary'].mean()

78663.00832512316